export default function Terms() {
  return (
    <main className="container">
      <div className="container mx-auto p-8">
        <h1 className="text-3xl font-bold mb-8">利用規約</h1>

        <div className="prose">
          <p>StickerMakerをご利用いただきありがとうございます。</p>
          <p>
            当サービスの利用に際して、以下の利用規約をお読みいただき、これに同意することが条件となります。
          </p>
          <h2 className="text-2xl font-bold my-4">利用条件の受諾</h2>
          <p>
            当サービスを利用することにより、利用者は本利用規約に同意したものとみなされます。本利用規約に同意できない場合は、直ちに当サービスの利用を中止してください。
          </p>
          <h2 className="text-2xl font-bold my-4">サービスの変更または中止 </h2>
          <p>
            運営者は事前の通知なしに、いつでも当サービスの内容や提供条件を変更する権利を有します。また、運営者は自己の裁量に基づき、いつでもサービスの提供を中止する権利を留保します。
          </p>
          <h2 className="text-2xl font-bold my-4">利用者の責任</h2>
          <p>
            利用者は、当サービスを法律および本利用規約に違反することなく利用する責任があります。利用者は、自身が提供した情報が正確であることを保証し、他の利用者または第三者に対して迷惑や損害を与えないよう努めなければなりません。
          </p>
          <h2 className="text-2xl font-bold my-4">知的財産権</h2>
          <p>
            当サービスに関する知的財産権は、運営者または関連する権利者に帰属しています。利用者は、事前の書面による許可なく、知的財産権を侵害する行為を行ってはなりません。
          </p>
          <h2 className="text-2xl font-bold my-4">免責事項</h2>
          <p>
            当サービスは、「現状のまま」提供され、明示または黙示を問わず、いかなる保証も行いません。運営者は当サービスの利用により生じるいかなる損害に対しても一切の責任を負いません。
          </p>
          <p className="mt-8">
            以上が、当サービスの利用に際する基本的な利用規約です。利用者は定期的に本ページを確認し、最新の利用規約に同意していただくことをお勧めします。
          </p>
        </div>
      </div>
    </main>
  );
}
